// SPDX-License-Identifier: Apache-2.0

/*
***************************************************************************************************
*
*   FileName : adc_test.c
*
*   Copyright (c) Telechips Inc.
*
*   Description :
*
*
***************************************************************************************************
*/

#if ( MCU_BSP_SUPPORT_TEST_APP_ADC  == 1 )

#include <adc_test.h>

#if ( MCU_BSP_SUPPORT_DRIVER_FMU == 1 )
    #include "fmu.h"
#endif  // ( MCU_BSP_SUPPORT_DRIVER_FMU == 1 )

#include <gic.h>
#include <debug.h>
#include <bsp.h>
#include <app_cfg.h>

/*
***************************************************************************************************
*                                             DEFINITIONS
***************************************************************************************************
*/

//----------------------------------------------------------------------------------------------------------------------------
// ADC controller register structure
//----------------------------------------------------------------------------------------------------------------------------
// MC_ADC_CMD_U
#define ADC_DMA_TEST_REG(N)             ((volatile ADCDmaxPort_t  *)(0xA0800000UL + (0x10000 * N)))
#define ADC_TEST_REG(N)                 ((volatile ADCTest_t      *)((0xA0080000UL) + (N * 0x10000UL)))
#define ADC_TEST_REG_SM(N)              ((volatile ADCTestAdcSM_t *)((0xA00A0000UL) + (N * 0x10000UL)))

#define HwHCLK_MASK0                    (0xA0F20000UL)
#define HwHCLK_MASK1                    (0xA0F20004UL)
#define HwSW_RESET0                     (0xA0F2000CUL)
#define HwSW_RESET1                     (0xA0F20010UL)

#define ADC_WriteReg(a,v)               (SAL_WriteReg(v,a))
#define ADC_ReadReg(a)                  (SAL_ReadReg(a))

#define ADC_MAX_MODULE                  (2)

#define ADC_BASE_ADDR(N)                ((0xA0080000UL) + (N * 0x10000UL))
#define ADC_SMP_CMD_STS                 (0x000UL)
#define ADC_IRQ_DREQ_STS                (0x004UL)
#define ADC_CTRL_CTG                    (0x008UL)
#define ADC_TIMING_CFG                  (0x040UL)
#define ADC_SD_OUT0                     (0x080UL)
#define ADC_SD_OUT1                     (0x084UL)
#define ADC_SD_OUT2                     (0x088UL)
#define ADC_SD_OUT3                     (0x08CUL)
#define ADC_SD_OUT4                     (0x090UL)
#define ADC_SD_OUT5                     (0x094UL)
#define ADC_SD_OUT6                     (0x098UL)
#define ADC_SD_OUT7                     (0x09CUL)
#define ADC_SD_OUT8                     (0x0A0UL)
#define ADC_SD_OUT9                     (0x0A4UL)
#define ADC_SD_OUT10                    (0x0A8UL)
#define ADC_SD_OUT11                    (0x0ACUL)

#define AMM_BASE_ADDR(N)                ((0xA00A0000UL) + (N * 0x10000UL))
#define AMM_SMP_CMD                     (0x000UL)
#define AMM_CTRL                        (0x010UL)
#define AMM_TO_VAL                      (0x014UL)
#define AMM_ACK_TO_VAL                  (0x018UL)

#define ADC_DMA_RSRVD_CHANNELS          (((0x0FCUL - 0x038UL) / 4UL) + 1UL)
#define ADC_DMA_RSRVD_PERIPHERAL_ID     (((0xFDCUL - 0x140UL) / 4UL) + 1UL)

#define ADC_MAX_CHANNEL                 (16U)
#define ADC_HALF_CHANNEL                (8UL)

#define ADC_SWRESET_REG                 (HwSW_RESET1)



/*
***************************************************************************************************
*                                             VARIABLES
***************************************************************************************************
*/

uint32 dma_test = 0;
uint32 DMABUF = 0;;

typedef struct ADCCmd
{
    uint32                              acCmd               : 16;   // [15:00], R/W
    uint32                              acNofAin            :  4;   // [19:16], RO
    uint32                              acCnvCnt            :  5;   // [24:20], RO
    uint32                                                  :  6;   // [30:25], Reserved
    uint32                              acCnvDone           :  1;   // [   31], RO
} ADCCmd_t;

typedef union ADCCmdUnion
{
    uint32                              cuNreg;
    ADCCmd_t                            cuBreg;
} ADCCmdUnion_t;

// MC_ADC_CLR_U
typedef struct ADCTestAdcClr
{
    uint32                              acClrIrq            :  1;   // [   00], R/W
    uint32                              acClrReq            :  1;   // [   01], R/W
    uint32                              acDmaAck            :  1;   // [   02], RO
    uint32                                                  : 29;   // [31:03], Reserved
} ADCTestAdcClr_t;

typedef union ADCTestAdcClrU
{
    uint32                              nReg;
    ADCTestAdcClr_t                     bReg;
} ADCTestAdcClrU_t;

// MC_ADC_CLK_U
typedef struct ADCTestAdcclk
{
    uint32                              clDiv               :  8;   // [07:00], R/W
    uint32                              clIrqEn             :  1;   // [   08], R/W
    uint32                              clReqEn             :  1;   // [   09], R/W
    uint32                                                  : 22;   // [31:10], Reserved
} ADCTestAdcclk_t;

typedef union ADCTestAdcclkU
{
    uint32                              nReg;
    ADCTestAdcclk_t                     bReg;
} ADCTestAdcclkU_t;

// MC_ADC_TIME_U
typedef struct ADCTestAdcTime
{
    uint32                              atPrePwrOn          :  4;   // [03:00], R/W
    uint32                              atSoc               :  4;   // [07:04], R/W
    uint32                              atPstPwrOff         :  4;   // [11:08], R/W
    uint32                              atCvt               :  4;   // [15:12], R/W
    uint32                              atPreSel            :  4;   // [19:16], R/W
    uint32                              atCaptureMode       :  1;   // [   20], R/W
    uint32                                                  : 11;   // [31:21], Reserved
} ADCTestAdcTime_t;

typedef union ADCTestAdcTimeU
{
    uint32                              nReg;
    ADCTestAdcTime_t                    bReg;
} ADCTestAdcTimeU_t;


typedef struct ADCTest
{
    ADCCmdUnion_t                       atAdcCmd;
    ADCTestAdcClrU_t                    atAdcClr;
    ADCTestAdcclkU_t                    atAdcClk;
    uint32                              atReserved0x00c[13];

    ADCTestAdcTimeU_t                   atAdcTime;
    uint32                              atReserved_0x044[15];

    uint32                              atAdcAin00;
    uint32                              atAdcAin01;
    uint32                              atAdcAin02;
    uint32                              atAdcAin03;
    uint32                              atAdcAin04;
    uint32                              atAdcAin05;
    uint32                              atAdcAin06;
    uint32                              atAdcAin07;
    uint32                              atAdcAin08;
    uint32                              atAdcAin09;
    uint32                              atAdcAin10;
    uint32                              atAdcAin11;
    uint32                              atAdcAin12;
    uint32                              atAdcAin13;
    uint32                              atAdcAin14;
    uint32                              atAdcAin15;
} ADCTest_t;



typedef struct ADCSmCmd
{
    uint32                              scCmd               : 16;   // [15:00], R/W
    uint32                                                  : 15;   // [30:16], Reserved
    uint32                              scCnvDone           :  1;   // [     31], RO
} ADCSmCmd_t;

typedef union ADCSmCmdU
{
    uint32                              nReg;
    ADCSmCmd_t                          bReg;
} ADCSmCmdU_t;

// ADCTestAdcSM_t_CTRL_U
typedef struct ADCSmCtrl
{
    uint32                              smAmmEn             :  1;   // [     00], R/W
    uint32                                                  :  3;   // [03:00], Reserved
    uint32                              smErrClr            :  1;   // [     04], R/W
    uint32                                                  : 27;   // [31:05], Reserved
} ADCSmCtrl_t;

typedef union ADCSmCtrlU
{
    uint32                              nReg;
    ADCSmCtrl_t                         bReg;
} ADCSmCtrlU_t;

// MC_ADC_SM_TO_VAL_U
typedef struct ADCSmToVal
{
    uint32                              tvToVal             :  32;   // [31:00], R/W
} ADCSmToVal_t;

typedef union ADCSmToValU
{
    uint32                              nReg;
    ADCSmToVal_t                        bReg;
} ADCSmToValU_t;

// MC_ADC_SM_ACK_TO_VAL_U
typedef struct ADCSmAckToVal
{
    uint32                              atAckToVal          :  16;   // [15:00], R/W
    uint32                                                  :  16;   // [31:16], Reserved
} ADCSmAckToVal_t;

typedef union ADCSmAckToValU
{
    uint32                              nReg;
    ADCSmAckToVal_t                     bReg;
} ADCSmAckToValU_t;


typedef struct ADCTestAdcSM
{
    ADCSmCmdU_t                         smAdcSmCmd;
    uint32                              smReserved0x004[3];
    ADCSmCtrlU_t                        smAdcSmCtrl;
    ADCSmToValU_t                       smAdcSmToVal;
    ADCSmAckToValU_t                    smAdcSmAckToVal;

} ADCTestAdcSM_t;


typedef struct  ADCDmaSch
{
    uint32                              scCh0               : 1;
    uint32                              scCh1               : 1;
    uint32                              scCh2               : 1;
    uint32                              scCh3               : 1;
    uint32                              scCh4               : 1;
    uint32                              scCh5               : 1;
    uint32                              scCh6               : 1;
    uint32                              scCh7               : 1;
    uint32                              scReserved          : 24;
} ADCDmaSch_t;

typedef union ADCDmaUch
{
    uint32                              duNreg;
    ADCDmaSch_t                         duBreg;
} ADCDmaUch_t;



typedef struct  ADCDmaReq
{
    uint32                              adReq0              : 1;
    uint32                              adReq1              : 1;
    uint32                              adReq2              : 1;
    uint32                              adReq3              : 1;
    uint32                              adReq4              : 1;
    uint32                              adReq5              : 1;
    uint32                              adReq6              : 1;
    uint32                              adReq7              : 1;
    uint32                              adReq8              : 1;
    uint32                              adReq9              : 1;
    uint32                              adReq10             : 1;
    uint32                              adReq11             : 1;
    uint32                              adReq12             : 1;
    uint32                              adReq13             : 1;
    uint32                              adReq14             : 1;
    uint32                              adReq15             : 1;
    uint32                              adReserved          : 16;
} ADCDmaReq_t;

typedef union ADCDmaUreq
{
    uint32                              drNreg;
    ADCDmaReq_t                         drBreg;
} ADCDmaUreq_t;

// Configuration register structure
typedef struct  ADCDmaScfg
{
    uint32                              dcCtrlEnable        : 1;
    uint32                              dcAhb1Endian        : 1;
    uint32                              dcAhb2Endian        : 1;
    uint32                              dcreserved          : (32-1-1-1);
} ADCDmaScfg_t;

typedef union ADCDmaUcfg
{
    uint32                              dcNreg;
    ADCDmaScfg_t                        dcBreg;
} ADCDmaUcfg_t;

// Channel linked list item register structure
typedef struct ADCDmaSchLli_
{
    uint32                              slNextLliBus        : 1;
    uint32                              slreserved          : 1;
    uint32                              slNextLli           : 30;
} ADCDmaSchLli_t;

typedef union ADCDmaUlli
{
    uint32                              dlNreg;
    ADCDmaSchLli_t                      dlBreg;
} ADCDmaUlli_t;

// Channel control register structure
typedef struct  ADCDmaSchCtrl
{
    uint32                              scTransferSize      : 12;
    uint32                              scSrcBurstSize      : 3;
    uint32                              scDestBurstSize     : 3;
    uint32                              scSrcWidth          : 3;
    uint32                              scDestWidth         : 3;
    uint32                              scSrcBus            : 1;
    uint32                              scDestBus           : 1;
    uint32                              scSrcIncrement      : 1;
    uint32                              scDestIncrement     : 1;
    uint32                              scProtection        : 3;
    uint32                              scInterruptEnable   : 1;
} ADCDmaSchCtrl_t;


typedef union ADCUchCtrol
{
    uint32                              rlNreg;
    ADCDmaSchCtrl_t                     rlBreg;
} ADCUchCtrol_t;

// Channel configuration register structure
typedef struct  ADCDmaSchCfg
{
    uint32                              cfChEnable          : 1;
    uint32                              cfSrcPeri           : 5;
    uint32                              cfDstPeri           : 5;
    uint32                              cfFlowCtrl          : 3;
    uint32                              cfErrIntMask        : 1;
    uint32                              cfIntMask           : 1;
    uint32                              cfBusLock           : 1;
    uint32                              cfActive            : 1;
    uint32                              cfHalt              : 1;
    uint32                              cfReserved          : 13;
} ADCDmaSchCfg_t;

typedef union ADCUchCfg
{
    uint32                              cfNreg;
    ADCDmaSchCfg_t                      cfBreg;
} ADCUchCfg_t;

// DMA Controller - DMA Channel Registers - template structure
typedef volatile struct ADCDmaxChannel
{
    uint32                              xcSrcAddrR;
    uint32                              xcDestAddr;
    ADCDmaUlli_t                        xcLli;
    ADCUchCtrol_t                       xcCtrl;
    ADCUchCfg_t                         xcCfg;
    uint32                              xcReserved0;
    uint32                              xcReserved1;
    uint32                              xcReserved2;

} ADCDmaxChannel_t;


typedef volatile struct ADCDmaxPort
{
    ADCDmaUch_t                         poIrqStatus;                                // 0x000
    ADCDmaUch_t                         poIrqItcStatus;                             // 0x004
    ADCDmaUch_t                         poIrqItcClear;                              // 0x008
    ADCDmaUch_t                         poIrqErrStatus;                             // 0x00C
    ADCDmaUch_t                         poIrqErrClear;                              // 0x010
    ADCDmaUch_t                         poRawIrqItcStatus;                          // 0x014
    ADCDmaUch_t                         poRawIrqErrStatus;                          // 0x018
    ADCDmaUch_t                         poEnabledChannel;                           // 0x01C
    ADCDmaUreq_t                        poSwBurstReq;                               // 0x020
    ADCDmaUreq_t                        poSwSingleReq;                              // 0x024
    ADCDmaUreq_t                        poSwLastBUrstReq;                           // 0x028
    ADCDmaUreq_t                        poSwLastSingleReq;                          // 0x02C
    ADCDmaUcfg_t                        poConfig;                                   // 0x030
    ADCDmaUreq_t                        poSync;                                     // 0x034

    uint32                              poReserved0[ADC_DMA_RSRVD_CHANNELS];        // 0x038 ~ 0x0FC

    ADCDmaxChannel_t                    poDmaChannel[2];                            // 0x100 ~ 0x13C

    uint32                              poReserved1[ADC_DMA_RSRVD_PERIPHERAL_ID];   // 0x140 ~ 0xFDC

    uint32                              poPeriId0;                                  // 0xFE0
    uint32                              poPeriId1;                                  // 0xFE4
    uint32                              poPeriId2;                                  // 0xFE8
    uint32                              poPeriId3;                                  // 0xFEC
    uint32                              poCellId0;                                  // 0xFF0
    uint32                              poCellId1;                                  // 0xFF4
    uint32                              poCellId2;                                  // 0xFF8
    uint32                              poCellId3;                                  // 0xFFC
} ADCDmaxPort_t;

static uint8                            dma_irq_check = 0;
static uint8                            dma_irq_check_for = 0;

static uint8                            adc_isr_done = 0;
static uint8                            fmu_isr_done = 0;
static uint32                           sampling_clock[3] = {4,9,24};

/*
***************************************************************************************************
*                                         FUNCTION PROTOTYPES
***************************************************************************************************
*/

static void wait_adc_irq_done
(
    void
);


static void wait_dma_irq
(
    void
);


#if ( MCU_BSP_SUPPORT_DRIVER_FMU == 1 )
static void wait_fmu_irq_done
(
    void
);

static void mc_fmu_fault_isr
(
    void *arg
);
#endif  // ( MCU_BSP_SUPPORT_DRIVER_FMU == 1 )

static void dma_adc_cfg
(
