// SPDX-License-Identifier: Apache-2.0

/*
***************************************************************************************************
*
*   FileName : gdma_ip_test.c
*
*   Copyright (c) Telechips Inc.
*
*   Description :
*
*
***************************************************************************************************
*/

#if ( MCU_BSP_SUPPORT_TEST_APP_GDMA == 1 )

#include "gdma_ip_test.h"
#include "gdma.h"
#include "clock.h"
#include <gic.h>
#include <debug.h>
#include "gpio.h"
#include "gdma_test.h"
#include "bsp.h"
#ifdef GDMA_IP_TEST_CODE
#include "uart_test.h"
#if (DEBUG_ENABLE)
#define GDMA_IP_DBG(fmt, args...)          {LOGD(DBG_TAG_GDMA, fmt, ## args)}
#else
#define GDMA_IP_DBG(fmt, args...)
#endif


//#define TODO_CHECK
/*
***************************************************************************************************
*                                             DEFINITIONS
***************************************************************************************************
*/
#define PARAM_CHECK_EN
#define TCC8050_TEST

#define TOP_SIM
//#define POST
#define AP_SRAM0_BASE   (0xf0000000)                      // 0xF0000000 ~ 0xF003FFFF
#define AP_SRAM0_0_BASE (AP_SRAM0_BASE+0x00000000)      // 0xF0000000 ~ 0xF000FFFF
#define AP_SRAM0_1_BASE (AP_SRAM0_BASE+0x00010000)      // 0xF0010000 ~ 0xF001FFFF
#define AP_SRAM0_2_BASE (AP_SRAM0_BASE+0x00020000)      // 0xF0020000 ~ 0xF002FFFF

                                    0x80000000,         // ADC
                                    0x80000000  };      // ADC_SM
#else // tcc8030
static uint32    ref_peri_data[34] = {   0x32150323,         // CAN0
                                    0x32150323,         // CAN1
                                    0x32150323,         // CAN2
                                    0x00000000,         // CAN_CFG
                                    0x00000000,         // GPSB0
                                    0x00000000,         // GPSB1
                                    0x00000000,         // GPSB2
                                    0x00000000,         // GPSB3
                                    0x03030100,         // GPSB_CFG
                                    0x00000000,         // GPSB_SM
                                    0x00000000,         // UART0
                                    0x00000000,         // UART1
                                    0x00000000,         // UART2
                                    0x00000000,         // UART3
                                    0x00000000,         // UART_DMA0
                                    0x00000000,         // UART_DMA1
                                    0x00000000,         // UART_DMA2
                                    0x00000000,         // UART_DMA3
                                    0x00000000,         // UART_CFG
                                    0x0000ffff,         // I2CM0
                                    0x0000ffff,         // I2CM1
                                    0x0000ffff,         // I2CM2
                                    0x00020100,         // I2CM_CFG
                                    0x00000000,         // I2CM0_SM
                                    0x00000000,         // I2CM1_SM
                                    0x00000000,         // I2CM2_SM
                                    0x00000000,         // ICTC0
                                    0x00000000,         // ICTC1
                                    0x00000000,         // ICTC2
                                    0x00000000,         // ICTC0_SM
                                    0x00000000,         // ICTC1_SM
                                    0x00000000,         // ICTC2_SM
                                    0x80000000,         // ADC
                                    0x80000000  };      // ADC_SM
#endif

/*
 Import ADC
*/
//----------------------------------------------------------------------------------------------------------------------------
// Define
//----------------------------------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------------------------------
// ADC controller register structure
//----------------------------------------------------------------------------------------------------------------------------
// MC_ADC_CMD_U
typedef struct {
    uint32                CMD             : 16;   // [15:00], R/W
    uint32                NOF_AIN         :  4;   // [19:16], RO
    uint32                CNV_CNT         :  5;   // [24:20], RO
    uint32                                :  6;   // [30:25], Reserved
    uint32                CNV_DONE        :  1;   // [   31], RO
} MC_ADC_CMD;

typedef union {
    uint32                nReg;
    MC_ADC_CMD          bReg;
} MC_ADC_CMD_U;

// MC_ADC_CLR_U
typedef struct {
    uint32                CLR_IRQ         :  1;   // [   00], R/W
    uint32                CLR_REQ         :  1;   // [   01], R/W
    uint32                DMA_ACK         :  1;   // [   02], RO
    uint32                                : 29;   // [31:03], Reserved
} MC_ADC_CLR;

typedef union {
    uint32                nReg;
    MC_ADC_CLR          bReg;
} MC_ADC_CLR_U;

// MC_ADC_CLK_U
typedef struct {
    uint32                DIV             :  8;   // [07:00], R/W
    uint32                IRQ_EN          :  1;   // [   08], R/W
    uint32                REQ_EN          :  1;   // [   09], R/W
    uint32                                : 22;   // [31:10], Reserved
} MC_ADC_CLK;

typedef union {
    uint32                nReg;
    MC_ADC_CLK          bReg;
} MC_ADC_CLK_U;

// MC_ADC_TIME_U
typedef struct {
    uint32                PRE_PWR_ON      :  4;   // [03:00], R/W
    uint32                SOC             :  4;   // [07:04], R/W
    uint32                PST_PWR_OFF     :  4;   // [11:08], R/W
    uint32                CVT             :  4;   // [15:12], R/W
    uint32                PRE_SEL         :  4;   // [19:16], R/W
    uint32                CAPTURE_MODE    :  1;   // [   20], R/W
    uint32                                : 11;   // [31:21], Reserved
} MC_ADC_TIME;

typedef union {
    uint32                nReg;
    MC_ADC_TIME         bReg;
} MC_ADC_TIME_U;

//----------------------------------------------------------------------------------------------------------------------------
// ADC controller register structure
//----------------------------------------------------------------------------------------------------------------------------
typedef struct {
    MC_ADC_CMD_U        uADC_CMD;               // 0x000
    MC_ADC_CLR_U        uADC_CLR;               // 0x004
    MC_ADC_CLK_U        uADC_CLK;               // 0x008
    uint32                reserved_0x00c[13];     // 0x00c ~ 0x03c

    MC_ADC_TIME_U       uADC_TIME;              // 0x040
    uint32                reserved_0x044[15];     // 0x044 ~ 0x07c

    uint32                uADC_AIN_00;            // 0x080
    uint32                uADC_AIN_01;            // 0x084
    uint32                uADC_AIN_02;            // 0x088
    uint32                uADC_AIN_03;            // 0x08c
    uint32                uADC_AIN_04;            // 0x090
    uint32                uADC_AIN_05;            // 0x094
    uint32                uADC_AIN_06;            // 0x098
    uint32                uADC_AIN_07;            // 0x09c
    uint32                uADC_AIN_08;            // 0x0a0
    uint32                uADC_AIN_09;            // 0x0a4
    uint32                uADC_AIN_10;            // 0x0a8
    uint32                uADC_AIN_11;            // 0x0ac
    uint32                uADC_AIN_12;            // 0x0b0
    uint32                uADC_AIN_13;            // 0x0b4
    uint32                uADC_AIN_14;            // 0x0b8
    uint32                uADC_AIN_15;            // 0x0bc
} MC_ADC;

/*
  Import ICTC
*/
//----------------------------------------------------------------------------------------------------------------------------
// Define
//----------------------------------------------------------------------------------------------------------------------------
#define     DMA_REQ_PRD_PVL         (0)
#define     DMA_REQ_PRD_PPVL        (1)
#define     DMA_REQ_DT_PVL          (2)
#define     DMA_REQ_DT_PPVL         (3)
#define     DMA_REQ_EDGE_CNT_CVL    (4)
#define     DMA_REQ_EDGE_CNT_PVL    (5)
#define     DMA_REQ_TS_RVL          (6)
#define     DMA_REQ_TS_FVL          (7)

#define     DMA_ENABLE              (1)
#define     DMA_DISABLE             (0)

#define     CMP_ERR_PRD_ONLY        (0)
#define     CMP_ERR_DT_ONLY         (1)
#define     CMP_ERR_PRD_DT          (2)

#define     FLT_MODE_RST            (0)
#define     FLT_MODE_HD             (1)
#define     FLT_MODE_UD             (2)
#define     FLT_MODE_IMM            (3)

#define     USE_ABS_SEL             (1)
#define     NO_ABS_SEL              (0)

#define     FEDGE_CNT_SEL           (1)
#define     REDGE_CNT_SEL           (0)

//----------------------------------------------------------------------------------------------------------------------------
// ICTC register structure
//----------------------------------------------------------------------------------------------------------------------------
typedef struct {
    uint32    PD_CMP_CNT_CLEAR    :  1; //[00:00]
    uint32    EDGE_CNT_CLEAR      :  1; //[01:01]
    uint32    TO_CNT_CLEAR        :  1; //[02:02]
    uint32    FLT_CNT_CLEAR       :  1; //[03:03]
    uint32    TS_CNT_CLEAR        :  1; //[04:04]
    uint32                        : 11; //[15:05]
    uint32    PD_CMP_CNT_EN       :  1; //[16:16]
    uint32    EDGE_CNT_EN         :  1; //[17:17]
    uint32    TO_CNT_EN           :  1; //[18:18]
    uint32    FLT_CNT_EN          :  1; //[19:19]
    uint32    TS_CNT_EN           :  1; //[20:20]
    uint32    TCLK_EN             :  1; //[21:21]
    uint32                        :  9; //[30:22]
    uint32    ICTC_EN             :  1; //[31:31]
} MC_ICTC_EN;

typedef union {
    uint32        nICTC_EN;
    MC_ICTC_EN  bICTC_EN;
} MC_ICTC_EN_U;

typedef struct {
    uint32    F_IN_SEL        : 8; //[07:00]
    uint32                    : 4; //[11:08]
    uint32    DMA_SEL         : 3; //[14:12]
    uint32    DMA_EN          : 1; //[15:15]
    uint32    CMP_ERR_SEL     : 2; //[17:16]
    uint32    FLT_R_MODE      : 2; //[19:18]
    uint32    FLT_F_MODE      : 2; //[21:20]
    uint32    TCLK_SEL        : 4; //[25:22]
    uint32    TCLK_POL        : 1; //[26:26]
    uint32                    : 1; //[27:27]
    uint32    FALL_EDGE_SEL   : 1; //[28:28]
    uint32    ABS_SEL         : 1; //[29:29]
    uint32                    : 1; //[30:30]
    uint32                    : 1; //[31:31]
} MC_ICTC_CTRL;

typedef union {
    uint32            nICTC_CTRL;
    MC_ICTC_CTRL    bICTC_CTRL;
} MC_ICTC_CTRL_U;

typedef struct {
    uint32    IRQ0    : 1; //[00:00] //read-only
    uint32    IRQ1    : 1; //[01:01] //read-only
    uint32    IRQ2    : 1; //[02:02] //read-only
    uint32    IRQ3    : 1; //[03:03] //read-only
    uint32    IRQ4    : 1; //[04:04] //read-only
    uint32    IRQ5    : 1; //[05:05] //read-only
    uint32    IRQ6    : 1; //[06:06] //read-only
    uint32    IRQ7    : 1; //[07:07] //read-only
    uint32    ICLR0   : 1; //[08:08]
    uint32    ICLR1   : 1; //[09:09]
    uint32    ICLR2   : 1; //[10:10]
    uint32    ICLR3   : 1; //[11:11]
    uint32    ICLR4   : 1; //[12:12]
    uint32    ICLR5   : 1; //[13:13]
    uint32    ICLR6   : 1; //[14:14]
    uint32    ICLR7   : 1; //[15:15]
    uint32    FLG0    : 1; //[16:16] //read-only
    uint32    FLG1    : 1; //[17:18] //read-only
    uint32    FLG2    : 1; //[18:18] //read-only
    uint32    FLG3    : 1; //[19:19] //read-only
    uint32    FLG4    : 1; //[20:20] //read-only
    uint32    FLG5    : 1; //[21:21] //read-only
    uint32    FLG6    : 1; //[22:22] //read-only
    uint32    FLG7    : 1; //[23:23] //read-only
    uint32    IEN0    : 1; //[24:24]
    uint32    IEN1    : 1; //[25:25]
    uint32    IEN2    : 1; //[26:26]
    uint32    IEN3    : 1; //[27:27]
    uint32    IEN4    : 1; //[28:28]
    uint32    IEN5    : 1; //[29:29]
    uint32    IEN6    : 1; //[30:30]
    uint32    IEN7    : 1; //[31:31]
} MC_ICTC_IRQ;

typedef union {
    uint32            nICTC_IRQ;
    MC_ICTC_IRQ     bICTC_IRQ;
} MC_ICTC_IRQ_U;

typedef struct {
    uint32    TO_VL   : 28; //[27:00]
    uint32            :  4; //[31:28]
} MC_ICTC_TO_VL;

typedef union {
    uint32            nICTC_TO_VL;
    MC_ICTC_TO_VL   bICTC_TO_VL;
} MC_ICTC_TO_VL_U;

typedef struct {
    uint32    REDGE_VL    : 28; //[27:00]
    uint32                :  4; //[31:28]
} MC_ICTC_REDGE_VL;

typedef union {
    uint32                nICTC_REDGE_VL;
    MC_ICTC_REDGE_VL    bICTC_REDGE_VL;
} MC_ICTC_REDGE_VL_U;

typedef struct {
    uint32    FEDGE_VL    : 28; //[27:00]
    uint32                :  4; //[31:28]
} MC_ICTC_FEDGE_VL;

typedef union {
    uint32                nICTC_FEDGE_VL;
    MC_ICTC_FEDGE_VL    bICTC_FEDGE_VL;
} MC_ICTC_FEDGE_VL_U;

typedef struct {
    uint32    PRD_RND_VL  : 28; //[27:00]
    uint32                :  4; //[31:28]
} MC_ICTC_PRD_RND_VL;

typedef union {
    uint32                nICTC_PRD_RND_VL;
    MC_ICTC_PRD_RND_VL  bICTC_PRD_RND_VL;
} MC_ICTC_PRD_RND_VL_U;

typedef struct {
    uint32    DT_RND_VL   : 28; //[27:00]
    uint32                :  4; //[31:28]
} MC_ICTC_DT_RND_VL;

typedef union {
    uint32                nICTC_DT_RND_VL;
    MC_ICTC_DT_RND_VL   bICTC_DT_RND_VL;
} MC_ICTC_DT_RND_VL_U;

typedef struct {
    uint32    ECNT_VL     : 16; //[15:00]
    uint32                : 16; //[31:16]
} MC_ICTC_ECNT_VL;

typedef union {
    uint32                nICTC_ECNT_VL;
    MC_ICTC_ECNT_VL     bICTC_ECNT_VL;
} MC_ICTC_ECNT_VL_U;

typedef struct {
    uint32    PRD_CNT_PVL : 28; //[27:00] //read-only
    uint32                :  4; //[31:28]
} MC_ICTC_PRD_CNT_PVL;

typedef union {
    uint32                    nICTC_PRD_CNT_PVL;
    MC_ICTC_PRD_CNT_PVL     bICTC_PRD_CNT_PVL;
} MC_ICTC_PRD_CNT_PVL_U;

typedef struct {
    uint32    PRD_CNT_PPVL    : 28; //[27:00] //read-only
    uint32                    :  4; //[31:28]
} MC_ICTC_PRD_CNT_PPVL;

typedef union {
    uint32                    nICTC_PRD_CNT_PPVL;
    MC_ICTC_PRD_CNT_PPVL    bICTC_PRD_CNT_PPVL;
} MC_ICTC_PRD_CNT_PPVL_U;

typedef struct {
    uint32    DT_CNT_PVL      : 28; //[27:00] //read-only
    uint32                    :  4; //[31:28]
} MC_ICTC_DT_CNT_PVL;

typedef union {
    uint32                    nICTC_DT_CNT_PVL;
    MC_ICTC_DT_CNT_PVL      bICTC_DT_CNT_PVL;
} MC_ICTC_DT_CNT_PVL_U;

typedef struct {
    uint32    DT_CNT_PPVL     : 28; //[27:00] //read-only
    uint32                    :  4; //[31:28]
} MC_ICTC_DT_CNT_PPVL;
typedef union {
    uint32                    nICTC_DT_CNT_PPVL;
    MC_ICTC_DT_CNT_PPVL     bICTC_DT_CNT_PPVL;
} MC_ICTC_DT_CNT_PPVL_U;

typedef struct {
    uint32    EDGE_DET_CNT_CVL    : 16; //[15:00] //read-only
    uint32                        : 16; //[31:16]
} MC_ICTC_EDGE_DET_CNT_CVL;

typedef union {
    uint32                        nICTC_EDGE_DET_CNT_CVL;
    MC_ICTC_EDGE_DET_CNT_CVL    bICTC_EDGE_DET_CNT_CVL;
} MC_ICTC_EDGE_DET_CNT_CVL_U;

typedef struct {
    uint32    EDGE_DET_CNT_PVL    : 16; //[15:00] //read-only
    uint32                        : 16; //[31:16]
} MC_ICTC_EDGE_DET_CNT_PVL;

typedef union {
    uint32                        nICTC_EDGE_DET_CNT_PVL;
    MC_ICTC_EDGE_DET_CNT_PVL    bICTC_EDGE_DET_CNT_PVL;
} MC_ICTC_EDGE_DET_CNT_PVL_U;

typedef struct {
    uint32    REDGE_TSCNT_VL      : 16; //[15:00] //read-only
    uint32                        : 16; //[31:16]
} MC_ICTC_REDGE_TSCNT_VL;
typedef union {
    uint32                    nICTC_REDGE_TSCNT_VL;
    MC_ICTC_REDGE_TSCNT_VL  bICTC_REDGE_TSCNT_VL;
} MC_ICTC_REDGE_TSCNT_VL_U;

typedef struct {
    uint32    FEDGE_TSCNT_VL      : 16; //[15:00] //read-only
    uint32                        : 16; //[31:16]
} MC_ICTC_FEDGE_TSCNT_VL;

typedef union {
    uint32                    nICTC_FEDGE_TSCNT_VL;
    MC_ICTC_FEDGE_TSCNT_VL  bICTC_FEDGE_TSCNT_VL;
} MC_ICTC_FEDGE_TSCNT_VL_U;


//==================================================================================
//              ICTC REGISTER MAP
//==================================================================================
typedef struct {
    MC_ICTC_EN_U                uICTC_EN;               //0x00 //0
    MC_ICTC_CTRL_U              uICTC_CTRL;             //0x04 //1
    MC_ICTC_IRQ_U               uICTC_IRQ;              //0x08 //2
    MC_ICTC_TO_VL_U             uICTC_TO_VL;            //0x0c //3
    MC_ICTC_REDGE_VL_U          uICTC_REDGE_VL;         //0x10 //4
    MC_ICTC_FEDGE_VL_U          uICTC_FEDGE_VL;         //0x14 //5
    MC_ICTC_PRD_RND_VL_U        uICTC_PRD_RND_VL;       //0x18 //6
    MC_ICTC_DT_RND_VL_U         uICTC_DT_RND_VL;        //0x1c //7
    MC_ICTC_ECNT_VL_U           uICTC_ECNT_VL;          //0x20 //8
    uint32                        undef00[3];             //0x24 ~ 0x2C
    MC_ICTC_PRD_CNT_PVL_U       uICTC_PRD_CNT_PVL;      //0x30 //12    0x20 //8
    MC_ICTC_PRD_CNT_PPVL_U      uICTC_PRD_CNT_PPVL;     //0x34 //13    0x24 //9
    MC_ICTC_DT_CNT_PVL_U        uICTC_DT_CNT_PVL;       //0x38 //14    0x28 //10
    MC_ICTC_DT_CNT_PPVL_U       uICTC_DT_CNT_PPVL;      //0x3C //15    0x2c //11
    MC_ICTC_EDGE_DET_CNT_CVL_U  uICTC_EDGE_DET_CNT_CVL; //0x40 //16    0x30 //12
    MC_ICTC_EDGE_DET_CNT_PVL_U  uICTC_EDGE_DET_CNT_PVL; //0x44 //17    0x34 //13
    MC_ICTC_REDGE_TSCNT_VL_U    uICTC_REDGE_TSCNT_VL;   //0x48
    MC_ICTC_FEDGE_TSCNT_VL_U    uICTC_FEDGE_TSCNT_VL;   //0x4C
} MC_ICTC;

/*
  Import DSEI
*/
// Interrupt mask
typedef struct {
    uint32                MAIN_AHBM           :  1;   //  [   00], RW
    uint32                AP_AHBMUX           :  1;   //  [   01], RW
    uint32                SYS_AHBMUX          :  1;   //  [   02], RW
    uint32                UART_AHBM           :  1;   //  [   03], RW
    uint32                PDM_AHBMUX          :  1;   //  [   04], RW
    uint32                MBOX_AHBMUX         :  1;   //  [   05], RW
    uint32                CAN_AHBM            :  1;   //  [   06], RW
    uint32                GPSB_AHBM           :  1;   //  [   07], RW
    uint32                reserved            : 24;   //  [31:08]
} MC_DEF_SLV_IRQ_MASK;

typedef union {
    uint32                nReg;
    MC_DEF_SLV_IRQ_MASK bReg;
} MC_DEF_SLV_IRQ_MASK_U;

// Interrupt enable
typedef struct {
    uint32                IRQ_EN              :  1;   //  [   00], RW
    uint32                reserved            : 31;   //  [31:01]
} MC_DEF_SLV_IRQ_EN;

typedef union {
    uint32                nReg;
    MC_DEF_SLV_IRQ_EN   bReg;
} MC_DEF_SLV_IRQ_EN_U;

// Default slave error IRQ handler
typedef struct {
    uint32                MAIN_AHBM_RESP_EN   :  1;   //  [   00], RW
    uint32                AP_AHBMUX_RESP_EN   :  1;   //  [   01], RW
    uint32                SYS_AHBMUX_RESP_EN  :  1;   //  [   02], RW
    uint32                UART_AHBM_RESP_EN   :  1;   //  [   03], RW
    uint32                PDM_AHBMUX_RESP_EN  :  1;   //  [   04], RW
    uint32                MBOX_AHBMUX_RESP_EN :  1;   //  [   05], RW
    uint32                reserved0           : 10;   //  [15:06]
    uint32                MAIN_AHBM_IRQ_EN    :  1;   //  [   16], RW
    uint32                AP_AHBMUX_IRQ_EN    :  1;   //  [   17], RW
    uint32                SYS_AHBMUX_IRQ_EN   :  1;   //  [   18], RW
    uint32                UART_AHBM_IRQ_EN    :  1;   //  [   19], RW
    uint32                PDM_AHBMUX_IRQ_EN   :  1;   //  [   20], RW
    uint32                MBOX_AHBMUX_IRQ_EN  :  1;   //  [   21], RW
    uint32                CAN_AHBM_IRQ_EN     :  1;   //  [   22], RW
    uint32                GPSB_AHBM_IRQ_EN    :  1;   //  [   23], RW
    uint32                reserved1           :  8;   //  [31:24]
} MC_DEF_SLV_CFG;

typedef union {
    uint32                nReg;
    MC_DEF_SLV_CFG      bReg;
} MC_DEF_SLV_CFG_U;

// Default slave error IRQ handler soft fault status
typedef struct {
    uint32                reserved0           :  1;   // [   00]
    uint32                REG_IRQ_MASK        :  1;   // [   01], RW, 0x0_4, HCLK clock mask-1
    uint32                REG_IRQ_ENABLE      :  1;   // [   02], RW, 0x0_8, HCLK clock mask-2
    uint32                REG_DEF_SLV_CFG     :  1;   // [   03], RW, 0x0_c, SW HRESETn mask-0
    uint32                REG_CFG_WR_PW       :  1;   // [   04], RW, 0x1_0, SW HRESETn mask-1
    uint32                REG_WR_LOCK         :  1;   // [   05], RW, 0x1_0, SW HRESETn mask-1
    uint32                reserved1           : 26;   // [31:06], Reserved
} MC_DEF_SLV_SOFT_FAULT_EN;

typedef union {
    uint32                        nReg;
    MC_DEF_SLV_SOFT_FAULT_EN    bReg;
} MC_DEF_SLV_SOFT_FAULT_EN_U;

//----------------------------------------------------------------------------------------------------------------------------
// Default slave error IRQ handler register structure
//----------------------------------------------------------------------------------------------------------------------------
typedef struct {
    MC_DEF_SLV_IRQ_MASK_U       uIRQ_STATUS;            // 0x00
    MC_DEF_SLV_IRQ_MASK_U       uIRQ_MASK;              // 0x04
    MC_DEF_SLV_IRQ_EN_U         uIRQ_ENABLE;            // 0x08
    MC_DEF_SLV_CFG_U            uDEF_SLV_CFG;           // 0x0c
    uint32                      uDEF_SLV_0;         // 0x10
    uint32                      uDEF_SLV_1;         // 0x14
    uint32                      uDEF_SLV_2;         // 0x18
    uint32                      uDEF_SLV_3;         // 0x1c
    uint32                      uDEF_SLV_4;         // 0x20
    uint32                      uDEF_SLV_5;         // 0x24
    uint32                      uDEF_SLV_6;         // 0x28
    uint32                      uDEF_SLV_7;         // 0x2c
    uint32                      uDEF_SLV_8;         // 0x30
    uint32                      reserved[3];            // 0x34-3c
    uint32                        CFG_WR_PW;              // 0x40
    uint32                        CFG_WR_LOCK;            // 0x44
    MC_DEF_SLV_SOFT_FAULT_EN_U  uSOFT_FAULT_EN;         // 0x48
    MC_DEF_SLV_SOFT_FAULT_EN_U  uSOFT_FAULT_STS;        // 0x4c
} MC_DEF_SLV;

#define CAPTURE_MODE_FSM    (0U)
#define CAPTURE_MODE_EOC    (1U)
#define DMA_CH_MAX  (2U)
#define DMA_CONTROL_MAX     (8U)

#define wr_data_32b(addr, data) (*(volatile uint32*)(addr)) = (uint32)(data)
#define rd_data_32b(addr)       (*(volatile uint32*)(addr))

//----------------------------------------------------------------------------------------------------------------------------
// Global Variable
//----------------------------------------------------------------------------------------------------------------------------
static uint32    dma_irq_check = 0;
//static uint32    dma_irq_check_cont_max= 0;

static uint32    ref_adc_data[16] = { 0x000, 0x08e, 0x11c, 0x1aa,
                             0x238, 0x2c7, 0x355, 0x3e3,
                             0x471, 0x4ff, 0x58e, 0x61c,
                             0x6aa, 0x738, 0x7c7, 0x855};

#define GDMA_TEST_MEM_BSE (0x3C000U)

